Repository: wangchong2023/zhiyu
Catalog: Sources/Localization/Lint.xcstrings
Source language: zh_hans
Languages: en

# lint.aiFixSuggestion
source: AI 修复建议: %@
en: AI Fix Suggestion: %@

# lint.aiScanning
source: 正在分析中...
en: AI Scanning...

# lint.aiSuggestionError
source: 无法获取 AI 建议: %@
en: Failed to get AI suggestion: %@

# lint.aiSuggestions
source: AI 建议
en: AI Suggestions

# lint.apply
source: 应用
en: Apply

# lint.brokenLink
source: 断链: 「%1$@」引用了不存在的页面 [[%2$@]]
en: Broken link: "%1$@" refers to missing page [[%2$@]]

# lint.brokenLinkSuggestion
source: 创建页面「%@」或修复链接
en: Create page "%@" or fix link

# lint.center.title
source: 健康检查
en: Lint Center

# lint.checking
source: 检查中...
en: Checking...

# lint.clearData
source: 清空历史
en: Clear History

# lint.cycleMessage
source: 循环引用: 「%1$@」与「%2$@」互相引用
en: Circular reference: "%1$@" and "%2$@" link to each other

# lint.cycleSuggestion
source: 考虑打破循环，建立单向引用或更高层级的聚合页面
en: Consider breaking the cycle with a one-way link or a higher-level aggregate page

# lint.detailIssues
source: 详细问题清单
en: Detailed Issues

# lint.errors
source: %d 个错误
en: %d Errors

# lint.foundIssues
source: 发现 %d 个问题
en: Found %d issues

# lint.goToPage
source: 前往页面
en: Go to Page

# lint.health.excellent
source: 非常健康
en: Excellent

# lint.health.fair
source: 尚可
en: Fair

# lint.health.good
source: 良好
en: Good

# lint.health.poor
source: 亟待优化
en: Needs Improvement

# lint.health.score
source: 健康得分
en: Health Score

# lint.lastCheck.never
source: 从未检查
en: Never

# lint.lastCheck.title
source: 上次检查时间
en: Last Checked

# lint.linkDiscoverySection
source: 潜在关联发现
en: Potential Link Discovery

# lint.metric.bridges
source: 关键桥梁
en: Bridge Nodes

# lint.metric.broken
source: 断开链接
en: Broken Links

# lint.metric.links
source: 总引用数
en: Total References

# lint.metric.orphans
source: 孤立节点
en: Orphan Nodes

# lint.metric.pages
source: 总节点数
en: Total Pages

# lint.noAISuggestions
source: 暂无 AI 建议
en: No AI Suggestions

# lint.noAISuggestionsHint
source: 运行深度扫描以获取 AI 建议。
en: Run a deep scan to get AI suggestions.

# lint.noIssues
source: 未发现问题
en: No Issues Found

# lint.noIssuesHint
source: 你的知识库非常整洁，请继续保持！
en: Your knowledge vault is very tidy. Keep it up!

# lint.orphanPage
source: 孤立页面: 「%@」没有任何反向链接
en: Orphan page: "%@" has no backlinks

# lint.orphanSuggestion
source: 考虑从相关页面添加 [[%@]] 链接
en: Consider adding [[%@]] links from related pages

# lint.outdated
source: 陈旧内容: 「%@」已超过 30 天未更新
en: Stale content: "%@" has not been updated in 30 days

# lint.outdatedSuggestion
source: 检视并更新过时的信息
en: Review and update outdated information

# lint.refactorSection
source: 重构建议
en: Refactor Suggestions

# lint.rule.error
source: 1 错误 = -10分
en: 1 Error = -10 pts

# lint.rule.info
source: 1 提示 = -2分
en: 1 Tip = -2 pts

# lint.rule.warning
source: 1 警告 = -5分
en: 1 Warning = -5 pts

# lint.runAIScan
source: 运行 AI 扫描
en: Run AI Scan

# lint.runCheck
source: 运行检查
en: Run Check

# lint.startCheck
source: 开始检查
en: Start Check

# lint.scanning
source: 正在扫描...
en: Scanning...

# lint.stubContent
source: 存根页面: 「%@」内容过少
en: Stub page: "%@" has very little content

# lint.stubSuggestion
source: 丰富页面内容，或将其合并至相关页面
en: Add more content or merge it into related pages

# lint.tips
source: %d 个优化建议
en: %d Optimization Tips

# lint.title
source: 健康检查
en: Health Check

# lint.warnings
source: %d 个警告
en: %d Warnings
